import {
    Container,
    SimpleGrid,
    Image,
    Flex,
    Heading,
    Text,
    Stack,
    Button,
    useColorModeValue,
  } from '@chakra-ui/react';
  
  export default function readmore() {
    return (
      <Flex background={useColorModeValue("pearl.50", "tuatara.950")} px={{ base: '20px', md: '0', }}>
      <Container 
        maxW='6xl' 
        py={12}
        pt='12'
        pb='12'
        px={{base: '10', md: '20',}}
        mx='auto'
        background={useColorModeValue("pearl.100", "tuatara.800")}
        border='1px'
        borderColor={useColorModeValue("tuatara.100", "tuatara.600")}
        boxShadow='xl'
        rounded='3xl'
        mt='100px'
        >
        <SimpleGrid columns={1} spacing={10}>
        <Flex>
            <Image
              border='1px'
              borderColor={useColorModeValue("tuatara.100", "tuatara.600")}
              height={{base: '200px', md: '540px'}}
              width='100%'
              rounded='3xl'
              shadow='lg'
              alt='feature image'
              src={
                '/f01.jpg'
              }
              objectFit='cover'
              _hover={{
                shadow: '2xl',
                transition: '1s ease',
              }}
            />
          </Flex>
        <Stack spacing={4} mt={2}>
            <Heading fontSize={{base: '2xl', md: '4xl',}} textAlign={{base: 'center', md: 'left',}} color={useColorModeValue("ash.800", "ash.200")} mb='3'>බුද්ධාගම යනු ?</Heading>
            <Text fontSize={{base: 'sm', md: 'lg',}} color={useColorModeValue("ash.700", "ash.300")} textAlign={'justify'}>
            බුද්ධාගම යනු බුද්ධ ධර්මය හෙවත් බුදු දහම පාදක කොට ගොඩනැගුනු ආගමකි. 
            ගෞතම බුදු රජාණන් වහන්සේ විසින් ඉගැන්වීම් මත පදනම් වූ  දහමකි. 
            එය ඉන්දියානු ආගමක් සහ දර්ශනකි.එය ආසියාවේ බොහෝ ප්‍රදේශ හරහා ව්‍යාප්ත වූ 
            ක්‍රිස්තු පූර්ව 6 වැනි සහ 4 වැනි සියවස් අතර කාලය තුළ ශ්‍රමණ දහමක් ලෙස පුරාණ 
            ඉන්දියාවේ දී ආරම්භ විය. එය ලොව සිව්වන විශාලතම ආගමයි. මිලියන 530කට අධික 
            අනුගාමිකයින් හෝ ගෝලීය ජනගහනයෙන් 7%කට වඩා වැඩි ප්‍රමාණයක්, බෞද්ධයන් ලෙස 
            හැඳින්වේ. බුදුදහම බොහෝ දුරට බුදුන්ගේ ඉගැන්වීම්  
            අර්ථකථනය කරන ලද දර්ශනය මත පදනම් වේ.<br /><br />
            බුදුරදුන්ගේ චතුරාර්ය සත්‍යයේ ප්‍රකාශිත පරිදි, බුදුදහමේ පරමාර්ථය වන්නේ දුක් 
            වේදනා ඇත (දුක්ඛ ආර්ය සත්‍යය), එය ඇති වීමට හේතුවක් ඇත (දුක්ඛ සමුදය ආර්ය සත්‍යය), 
            එය ඇති වීමට හේතුව ඇත එම හේතුව නතර කිරීම (දුක්ඛ නිරෝධ ආර්ය සත්‍යය), 
            එහි අවසානය ගෙන ඒන මගෙ හි ගමන් කිරීම ය (දුක්ඛ නිරෝධ ගාමිණි පටිපදා ආර්ය සත්‍යය).<br /><br />
            බුදු දහම සිව්වන විශාලතම ආගමයි. මිලියන 530කට අධික අනුගාමිකයින් හෝ ගෝලීය 
            ජනගහනයෙන් 7%කට වඩා වැඩි ප්‍රමාණයක්, බෞද්ධයන් ලෙස හැඳින්වේ.විශාලතම බෞද්ධ 
            ජනගහණය ජීවත් වන්නේ චීනයේය. එය මිලියන 251ක් පමණ වේ. ශ්‍රී ලංකාව, භූතානය,
             මියන්මාරය, තායිලන්තය, කාම්බෝජය, ලාඕසය, මොංගෝලියාව, ජපානය, සිංගප්පූරුව,
              කල්මිකියාව,ටුවා යන රටවල බහුතර ආගම බුදු දහමයි. බුදු දහම ශ්‍රී ලංකාව, භූතානය,
               මියන්මාරය, තායිලන්තය, කාම්බෝජය, ලාඕසය, මොංගෝලියාව යන රටවල රාජ්‍ය ආගම වේ.<br /><br />
            බුදුන් දේශනා කළ සතර සත්‍යයන්ට අනුව, බුද්ධාගමෙහි ප්‍රධාන අරමුණ වනුයේ දුකින් (දුක්ඛ) 
            මිදීමයි. බුදු දහමට අනුව දුක ඇතිවන්නේ තෘෂ්ණාව (තණ්හා) සහ යථාර්ථයෙහි සැබෑ ස්වභාවය 
            (එනම් අනිත්‍යතාව සහ අනාත්මතාව) ගැන නොදැනුවත්කම (අවිද්‍යා) නිසාය. දුකින් මිදීම නිර්වාණය 
            යනුවෙන් හැඳින්වෙන අතර එමගින් උපත සහ මරණය සිදුවෙන චක්‍රය (සංසාරය) අවසන් වේ.<br /><br />
            පුද්ගලයා මුහුණදෙන දුක, හා එයට පුද්ගලයාගේ ඇති වගකීමත්(බැඳීමත්), එම දුකෙන් මිදීමට 
            පුද්ගලයාගේ ඇති ශක්‍යතාව හෙවත් නිවන ප්‍රායෝගිකව ලැබියහැකි ප්‍රත්‍යක්ෂයක් බවත්, ඒ 
            සඳහා අනුගමනය කලයුතු ක්‍රියාමාර්ගයත් පෙන්වාදීම බුදුදහමේ පණිවුඩයයි. ගෞතම බුදුන් 
            වහන්සේගේ දේශනා තුළ කියවෙන්නේ දිගින් දිගටම ඉපදෙමින් මැරෙමින් යන සංසාරය ඉතාම 
            දුක් සහිත බවත් අප්‍රමාදීව මේ පැවැත්ම නවත්වන ප්‍රතිපදාවකට අවතීර්ණ වන ලෙසත්ය. 
            එසේ අනතුරු හැඟවීමෙන් නොනවතින බුදු හිමියන් මේ (ඉපදෙමින් මැරෙමින් යන) සසර 
            පැවැත්මට හේතුවත්, එම හේතුව නැති කර දැමීමෙන් භව ගමන නතර කළ හැකි බවත් 
            පෙන්වා දෙයි. එසේ නතර කිරීම පිණිස ඇති වැඩ පිළිවෙලද පරිපූර්ණ ආකාරයට ඉදිරිපත් කරයි.<br /><br />
            -Wikipedia
            </Text>
          </Stack>
          <Button
              as={'a'}
              target={'_blank'}
              href={'https://si.wikipedia.org/wiki/%E0%B6%B6%E0%B7%94%E0%B6%AF%E0%B7%8A%E0%B6%B0%E0%B7%8F%E0%B6%9C%E0%B6%B8'}
              maxW={'140px'}
              mx={'auto'}
              px={4}
              fontSize={'md'}
              shadow={'lg'}
              rounded={'2xl'}
              bg='flemingo.500'
              color={'ash.100'}
        
              _hover={{
                  color: "ash.50",
                  bg: "flemingo.700",
                  boxShadow: "xl",
              }}
              >
              තව කියවන්න.
            </Button>
        </SimpleGrid>
      </Container>
      </Flex>
    );
  }